; ModuleID = 'gc.c'
source_filename = "gc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GCHandler = type { i32, i32, i8*, i8*, %struct.MemNode*, void (void (i8*)*, i32 (i8*)*)* }
%struct.MemNode = type { i32, i8*, i32 }
%struct.Mempool = type { i32, i8* }

; Function Attrs: noinline nounwind uwtable
define void @GCInit(%struct.GCHandler* noalias sret, i32, i8*, i32, i8*, void (void (i8*)*, i32 (i8*)*)*) #0 !dbg !25 {
  %7 = alloca %struct.Mempool, align 8
  %8 = alloca %struct.Mempool, align 8
  %9 = alloca void (void (i8*)*, i32 (i8*)*)*, align 8
  %10 = alloca %struct.GCHandler, align 8
  %11 = alloca %struct.MemNode*, align 8
  %12 = bitcast %struct.Mempool* %7 to { i32, i8* }*
  %13 = getelementptr inbounds { i32, i8* }, { i32, i8* }* %12, i32 0, i32 0
  store i32 %1, i32* %13, align 8
  %14 = getelementptr inbounds { i32, i8* }, { i32, i8* }* %12, i32 0, i32 1
  store i8* %2, i8** %14, align 8
  %15 = bitcast %struct.Mempool* %8 to { i32, i8* }*
  %16 = getelementptr inbounds { i32, i8* }, { i32, i8* }* %15, i32 0, i32 0
  store i32 %3, i32* %16, align 8
  %17 = getelementptr inbounds { i32, i8* }, { i32, i8* }* %15, i32 0, i32 1
  store i8* %4, i8** %17, align 8
  call void @llvm.dbg.declare(metadata %struct.Mempool* %7, metadata !55, metadata !56), !dbg !57
  call void @llvm.dbg.declare(metadata %struct.Mempool* %8, metadata !58, metadata !56), !dbg !59

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.1-6 (tags/RELEASE_401/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10)
!1 = !DIFile(filename: "gc.c", directory: "/home/dk/outside/Project/Schmidty/lib")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemState", file: !4, line: 11, size: 32, elements: !5)
!4 = !DIFile(filename: "./gc.h", directory: "/home/dk/outside/Project/Schmidty/lib")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "idle", value: 0)
!7 = !DIEnumerator(name: "inUse", value: 1)
!8 = !DIEnumerator(name: "markedIdle", value: 2)
!9 = !DIEnumerator(name: "markedUse", value: 3)
!10 = !{!11, !17, !20}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemNode", file: !4, line: 22, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 18, size: 192, elements: !14)
!14 = !{!15, !16, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !13, file: !4, line: 19, baseType: !3, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !4, line: 20, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !13, file: !4, line: 21, baseType: !19, size: 32, offset: 128)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{!"clang version 4.0.1-6 (tags/RELEASE_401/final)"}
!25 = distinct !DISubprogram(name: "GCInit", scope: !1, file: !1, line: 9, type: !26, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !49, !49, !37}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCHandler", file: !4, line: 31, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 24, size: 320, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "usesize", scope: !29, file: !4, line: 25, baseType: !19, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idlesize", scope: !29, file: !4, line: 26, baseType: !19, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "mempoolInUse", scope: !29, file: !4, line: 27, baseType: !17, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mempoolIdle", scope: !29, file: !4, line: 28, baseType: !17, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !29, file: !4, line: 29, baseType: !11, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "gothrough", scope: !29, file: !4, line: 30, baseType: !37, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gothrougher", file: !4, line: 4, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !45}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "Marker", file: !4, line: 2, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !17}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "Marked", file: !4, line: 3, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!19, !17}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mempool", file: !4, line: 9, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 6, size: 128, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !4, line: 7, baseType: !19, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !50, file: !4, line: 8, baseType: !17, size: 64, offset: 64)
!54 = !{}
!55 = !DILocalVariable(name: "memUse", arg: 1, scope: !25, file: !1, line: 9, type: !49)
!56 = !DIExpression()
!57 = !DILocation(line: 9, column: 26, scope: !25)
!58 = !DILocalVariable(name: "memIdle", arg: 2, scope: !25, file: !1, line: 9, type: !49)
!59 = !DILocation(line: 9, column: 42, scope: !25)
!60 = !DILocalVariable(name: "gothrough", arg: 3, scope: !25, file: !1, line: 9, type: !37)
!61 = !DILocation(line: 9, column: 63, scope: !25)
!62 = !DILocalVariable(name: "ret", scope: !25, file: !1, line: 11, type: !28)
!63 = !DILocation(line: 11, column: 15, scope: !25)
!64 = !DILocation(line: 12, column: 26, scope: !25)
!65 = !DILocation(line: 12, column: 9, scope: !25)
!66 = !DILocation(line: 12, column: 17, scope: !25)
!67 = !DILocation(line: 13, column: 28, scope: !25)
!68 = !DILocation(line: 13, column: 9, scope: !25)
!69 = !DILocation(line: 13, column: 18, scope: !25)
!70 = !DILocation(line: 14, column: 31, scope: !25)
!71 = !DILocation(line: 14, column: 9, scope: !25)
!72 = !DILocation(line: 14, column: 22, scope: !25)
!73 = !DILocation(line: 15, column: 31, scope: !25)
!74 = !DILocation(line: 15, column: 9, scope: !25)
!75 = !DILocation(line: 15, column: 21, scope: !25)
!76 = !DILocalVariable(name: "firstnodept", scope: !25, file: !1, line: 16, type: !11)
!77 = !DILocation(line: 16, column: 14, scope: !25)
!78 = !DILocation(line: 16, column: 46, scope: !25)
!79 = !DILocation(line: 16, column: 28, scope: !25)
!80 = !DILocation(line: 17, column: 5, scope: !25)
!81 = !DILocation(line: 17, column: 18, scope: !25)
!82 = !DILocation(line: 17, column: 21, scope: !25)
!83 = !DILocation(line: 18, column: 5, scope: !25)
!84 = !DILocation(line: 18, column: 18, scope: !25)
!85 = !DILocation(line: 18, column: 23, scope: !25)
!86 = !DILocation(line: 19, column: 32, scope: !25)
!87 = !DILocation(line: 19, column: 25, scope: !25)
!88 = !DILocation(line: 19, column: 37, scope: !25)
!89 = !DILocation(line: 19, column: 5, scope: !25)
!90 = !DILocation(line: 19, column: 18, scope: !25)
!91 = !DILocation(line: 19, column: 23, scope: !25)
!92 = !DILocation(line: 20, column: 17, scope: !25)
!93 = !DILocation(line: 20, column: 9, scope: !25)
!94 = !DILocation(line: 20, column: 15, scope: !25)
!95 = !DILocation(line: 21, column: 21, scope: !25)
!96 = !DILocation(line: 21, column: 9, scope: !25)
!97 = !DILocation(line: 21, column: 19, scope: !25)
!98 = !DILocation(line: 22, column: 12, scope: !25)
!99 = !DILocation(line: 22, column: 5, scope: !25)
!100 = distinct !DISubprogram(name: "GCAlloc", scope: !1, file: !1, line: 25, type: !101, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!101 = !DISubroutineType(types: !102)
!102 = !{!17, !103, !19}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!104 = !DILocalVariable(name: "handle", arg: 1, scope: !100, file: !1, line: 25, type: !103)
!105 = !DILocation(line: 25, column: 26, scope: !100)
!106 = !DILocalVariable(name: "size", arg: 2, scope: !100, file: !1, line: 25, type: !19)
!107 = !DILocation(line: 25, column: 38, scope: !100)
!108 = !DILocalVariable(name: "ret", scope: !100, file: !1, line: 26, type: !11)
!109 = !DILocation(line: 26, column: 14, scope: !100)
!110 = !DILocation(line: 26, column: 29, scope: !100)
!111 = !DILocation(line: 26, column: 37, scope: !100)
!112 = !DILocation(line: 26, column: 44, scope: !100)
!113 = !DILocation(line: 26, column: 20, scope: !100)
!114 = !DILocation(line: 27, column: 8, scope: !115)
!115 = distinct !DILexicalBlock(scope: !100, file: !1, line: 27, column: 8)
!116 = !DILocation(line: 27, column: 12, scope: !115)
!117 = !DILocation(line: 27, column: 8, scope: !100)
!118 = !DILocation(line: 29, column: 22, scope: !119)
!119 = distinct !DILexicalBlock(scope: !115, file: !1, line: 27, column: 21)
!120 = !DILocation(line: 29, column: 9, scope: !119)
